RIET/src/Catalogs/СтрокиИнвойса/СтрокиИнвойса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиИнвойса</name>
  <attributes>
    <name>Инвойс</name>
    <type>
      <types>DocumentRef.Инвойс</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportRequest</name>
    <type>
      <types>DocumentRef.ExportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиИнвойса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаЗаявкиНаЗакупку</name>
    <type>
      <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоИнвойсу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RAN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>CatalogRef.Catalog</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Классификатор</name>
    <type>
      <types>EnumRef.ТипыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Активити</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>String</types>
      <types>CatalogRef.CountriesHUBs</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Manufacturer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйКодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящейДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NetWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WeightUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>PSA</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>Final</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LocalOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shortage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EUCNotRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EUCRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EUCReceived</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TNVED</name>
    <type>
      <types>CatalogRef.TNVEDCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>COORequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>ERPTreatmentNonLawson</name>
    <type>
      <types>CatalogRef.ERPTreatments</types>
    </type>
  </attributes>
  <attributes>
    <name>ProjectMobilization</name>
    <type>
      <types>CatalogRef.ProjectMobilization</types>
    </type>
  </attributes>
  <attributes>
    <name>HazardClass</name>
    <type>
      <types>CatalogRef.HazardClasses</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteeLetter</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>MOC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ClientPO</name>
    <type>
      <types>CatalogRef.ClientPO</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfirmationOfCargoLatestDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBSReceiptDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BPN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPLetterRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Enums/DomesticInternational/DomesticInternational.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DomesticInternational</name>
  <enumValues>
    <name>Domestic</name>
  </enumValues>
  <enumValues>
    <name>International</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/Инвойс/Инвойс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвойс</name>
  <attributes>
    <name>Голд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Декларант</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.Incoterms</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>OperatingLocation</name>
    <type>
      <types>CatalogRef.OperatingLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаДоставку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страховка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SkipSomeChecks</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DSSNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхивИмпортЭкспорт</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬГрузополучатель</name>
    <type>
      <types>CatalogRef.УДАЛИТЬDeliverTo</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬПолноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PayingEntity</name>
    <type>
      <types>EnumRef.PayingEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Catalogs/СтрокиИнвойса/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзParcelLine" Тогда
			НастроитьДляВыбораИзParcelLine(СтруктураНастройки);
		ИначеЕсли СтруктураНастройки.Имя = "ВыборИзInvoiceLinesСlassification" Тогда
			НастроитьДляВыбораИзInvoiceLinesСlassification(СтруктураНастройки);
		ИначеЕсли СтруктураНастройки.Имя = "ВыборИзService" Тогда
			НастроитьДляВыбораИзService(Отказ, СтруктураНастройки);
		ИначеЕсли СтруктураНастройки.Имя = "ВыборИзManualItem" Тогда
			НастроитьДляВыбораИзManualItem(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли; 
	
	// { RGS AFokin 13.09.2018 23:59:59 - S-I-0005710
	Если Параметры.Свойство("СписокДляОтбора") Тогда
		НастроитьСписокСОтбором(Параметры.СписокДляОтбора);
	КонецЕсли;	
	// } RGS AFokin 13.09.2018 23:59:59 - S-I-0005710
	
	Элементы.НадписьYouCanSelectMultiple.Видимость = Параметры.Свойство("МножественныйВыбор") И Параметры.МножественныйВыбор = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзParcelLine(СтруктураНастройки)
	
	СтруктураОтбора = Параметры.Отбор;
	
	Если СтруктураНастройки.LocalOnly Тогда
						
		Если ЗначениеЗаполнено(СтруктураНастройки.TransportRequest) Тогда
			// Настроим видимость колонок
			РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "Наименование", "Видимость", Ложь);
			РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "СтрокаЗаявкиНаЗакупку", "Видимость", Ложь);
			РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "SoldTo", "Видимость", Ложь);
			РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "КостЦентр", "Видимость", Ложь);
			РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "Активити", "Видимость", Ложь);
		    РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "НомерВходящейДекларации", "Видимость", Ложь);
			
			СтруктураОтбора.Вставить("TransportRequest", СтруктураНастройки.TransportRequest);
			
		Иначе 
			
			СтруктураОтбора.Вставить("Инвойс", Документы.Инвойс.ПустаяСсылка());
			СтруктураОтбора.Вставить("ExportRequest", Документы.ExportRequest.ПустаяСсылка());
			СтруктураОтбора.Вставить("TransportRequest", Документы.TransportRequest.ПустаяСсылка());
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураНастройки.ExportRequest) Тогда
		
		// Настроим видимость колонок
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "Наименование", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "СтрокаЗаявкиНаЗакупку", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "SoldTo", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "КостЦентр", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "Классификатор", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "Активити", "Видимость", Ложь);
		
		СтруктураОтбора.Вставить("ExportRequest", СтруктураНастройки.ExportRequest);
		СтруктураОтбора.Вставить("TransportRequest", Документы.TransportRequest.ПустаяСсылка());
		
	Иначе
		
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "Код", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "RAN", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "НомерВходящейДекларации", "Видимость", Ложь);
		РГСофтКлиентСервер.НастроитьЭлементЕслиОнЕсть(Элементы, "SoldTo", "Видимость", Ложь);
		СтруктураОтбора.Вставить("TransportRequest", Документы.TransportRequest.ПустаяСсылка());
		
		DONo = СтруктураНастройки.DONo;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Инвойс.НомерЗаявкиНаДоставку",
			СокрЛП(DONo),
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Инвойс.Отменен",
			Ложь,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
		
	КонецЕсли; 
	
	СтруктураParcelLine = Неопределено;
	Если СтруктураНастройки.Свойство("СтруктураParcelLine") Тогда
		
		СтруктураParcelLine = СтруктураНастройки.СтруктураParcelLine;
		
		Если НЕ ЗначениеЗаполнено(СтруктураНастройки.ExportRequest) 
			И НЕ ЗначениеЗаполнено(СтруктураНастройки.TransportRequest) Тогда
			
			PONo = СокрЛП(СтруктураParcelLine.НомерЗаявкиНаЗакупку);
			Если ЗначениеЗаполнено(PONo) Тогда
				СтруктураОтбора.Вставить("НомерЗаявкиНаЗакупку", PONo);	
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтруктураParcelLine.СтрокаЗаявкиНаЗакупку) Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
					Список.Отбор,
					"СтрокаЗаявкиНаЗакупку.НомерСтрокиЗаявкиНаЗакупку",
					СтруктураParcelLine.СтрокаЗаявкиНаЗакупку,
					ВидСравненияКомпоновкиДанных.Равно,
					,
					Истина);
					
			КонецЕсли; 
		
			Receiver = СокрЛП(СтруктураParcelLine.Receiver);
			Если ЗначениеЗаполнено(Receiver) Тогда
				СтруктураОтбора.Вставить("ImportReference", Receiver);	
			КонецЕсли; 
			
		КонецЕсли;	
			
		SerialNo = СокрЛП(СтруктураParcelLine.СерийныйНомер);
		Если ЗначениеЗаполнено(SerialNo) Тогда	
			СтруктураОтбора.Вставить("СерийныйНомер", SerialNo);	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СтруктураParcelLine.Qty) Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор,
				"Количество",
				СтруктураParcelLine.Qty,
				ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
				,
				Истина);
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СтруктураParcelLine.QtyUOM) Тогда
			СтруктураОтбора.Вставить("ЕдиницаИзмерения", СтруктураParcelLine.QtyUOM);
		КонецЕсли;
		
	КонецЕсли;                                                                     
	
	ТаблицаДанныхInvoiceLines = Справочники.Parcels.ПолучитьТаблицуInvoiceLinesПодходящихДляParcelLine(СтруктураНастройки.DONo, 
		СтруктураНастройки.LocalOnly, СтруктураНастройки.ExportRequest, СтруктураНастройки.TransportRequest,
		СтруктураНастройки.CurrentParcel, СтруктураНастройки.СоответствиеInvoiceLinesИQty, СтруктураParcelLine);
	МассивInvoiceLines = ТаблицаДанныхInvoiceLines.ВыгрузитьКолонку("InvoiceLine");
	СтруктураОтбора.Вставить("Ссылка", МассивInvoiceLines);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзInvoiceLinesСlassification(СтруктураНастройки)
	
	СтруктураОтбора = Параметры.Отбор;
	МассивСтрокИнвойсов = Документы.Поставка.ПолучитьМассивСтрокИнвойсовПоставки(СтруктураНастройки.InvoiceLinesMatching.Поставка);
	СтруктураОтбора.Вставить("Ссылка", МассивСтрокИнвойсов);
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзService(Отказ, СтруктураНастройки)
	
	ТипЗнчDocumentBase = ТипЗнч(СтруктураНастройки.DocumentBase);
	Если ТипЗнчDocumentBase = Тип("ДокументСсылка.CustomsFilesLight") Тогда
		
		Shipment = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктураНастройки.DocumentBase, "Shipment");
		Если НЕ ЗначениеЗаполнено(Shipment) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"У """ + СтруктураНастройки.DocumentBase + """ не заполнено поле ""Shipment""!",
				, , , Отказ);
			Возврат;
		КонецЕсли;
		
		МассивShipmentGoods = Документы.Поставка.ПолучитьМассивСтрокИнвойсовПоставки(Shipment);
		
	ИначеЕсли ТипЗнчDocumentBase = Тип("ДокументСсылка.Поставка") Тогда
		
		МассивShipmentGoods = Документы.Поставка.ПолучитьМассивСтрокИнвойсовПоставки(СтруктураНастройки.DocumentBase);
		
	ИначеЕсли ТипЗнчDocumentBase = Тип("ДокументСсылка.ExportShipment") Тогда
		
		МассивShipmentGoods = Документы.ExportShipment.ПолучитьItemsOfExportShipment(СтруктураНастройки.DocumentBase);
		
	ИначеЕсли ТипЗнчDocumentBase = Тип("ДокументСсылка.TemporaryImpExpTransactions") Тогда
		
		МассивShipmentGoods = Документы.TemporaryImpExpTransactions.ПолучитьItemsOfTemporaryImpExpTransactions(СтруктураНастройки.DocumentBase);
		
	КонецЕсли;
	
	МассивДоступныхGoods = РГСофтКлиентСервер.ВычестьМассивы(МассивShipmentGoods, СтруктураНастройки.МассивТекущихInvoiceLines);
	
	СтруктураОтбора = Параметры.Отбор;
	СтруктураОтбора.Вставить("Ссылка", МассивДоступныхGoods);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	МассивНайденныхОтборов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(
		Список.Отбор,
		"Ссылка");
		
	Если МассивНайденныхОтборов.Количество() Тогда
		
		ОтборПоСсылке = МассивНайденныхОтборов[0];
		Если ТипЗнч(ОтборПоСсылке.ПравоеЗначение) <> Тип("СписокЗначений") Тогда
			СтароеЗначение = ОтборПоСсылке.ПравоеЗначение;
			ОтборПоСсылке.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ОтборПоСсылке.ПравоеЗначение = Новый СписокЗначений;
			ОтборПоСсылке.ПравоеЗначение.Добавить(СтароеЗначение);
		КонецЕсли; 
		
		ОтборПоСсылке.ПравоеЗначение.Добавить(НовыйОбъект);
		
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзManualItem(СтруктураНастройки)
	
	СтруктураОтбора = Параметры.Отбор;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"КодПоИнвойсу",
		СтруктураНастройки.КодПоИнвойсу,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);

	Если ЗначениеЗаполнено(СтруктураНастройки.POLine) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"СтрокаЗаявкиНаЗакупку",
		СтруктураНастройки.POLine,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
	КонецЕсли; 
	
	Если СтруктураНастройки.свойство("ProjectMobilization") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"ProjectMobilization",
		СтруктураНастройки.ProjectMobilization,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	Список.Отбор,
	"TransportRequest",
	,
	?(СтруктураНастройки.DomesticInternational = Перечисления.DomesticInternational.Domestic, 
	ВидСравненияКомпоновкиДанных.Заполнено, ВидСравненияКомпоновкиДанных.НеЗаполнено),
	,
	Истина);
	
	Если ЗначениеЗаполнено(СтруктураНастройки.POLine) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"СтрокаЗаявкиНаЗакупку",
		СтруктураНастройки.POLine,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
	КонецЕсли; 

	Если СтруктураНастройки.свойство("PickUpWarehouse") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"TransportRequest.PickUpWarehouse",
		СтруктураНастройки.PickUpWarehouse,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
	КонецЕсли;

	Если СтруктураНастройки.свойство("DeliverTo") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"TransportRequest.DeliverTo",
		СтруктураНастройки.DeliverTo,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
	КонецЕсли;

КонецПроцедуры

// { RGS AFokin 13.09.2018 23:59:59 - S-I-0005710
&НаСервере
Процедура НастроитьСписокСОтбором(МассивНомеров)
	
	СписокКодовItems = Новый СписокЗначений;
	СписокКодовItems.ЗагрузитьЗначения(МассивНомеров);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Код", СписокКодовItems, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
КонецПроцедуры
// } RGS AFokin 13.09.2018 23:59:59 - S-I-0005710
